app/Views/buku/index.php

SELECT *
FROM `peminjaman`
WHERE `id_buku` = '27'
AND `id_user` = '1'
AND `status` IN ('pending','disetujui','dipinjam')
ORDER BY `id_peminjaman` DESC
SELECT *
FROM `peminjaman`
WHERE `id_buku` = '27'
AND `id_user` = '1'
AND `status` = 'kembali'
---
        <?php foreach ($buku as $b): ?>
            <?php
                $db = \Config\Database::connect();
                $checkStatus = $db->table('peminjaman')
                    ->where(['id_buku' => $b['id_buku'], 'id_user' => session()->get('id')])
                    ->whereIn('status', ['pending', 'disetujui', 'dipinjam'])
                    ->orderBy('id_peminjaman', 'DESC')->get()->getRowArray();

                $sudahSelesai = $db->table('peminjaman')
                    ->where(['id_buku' => $b['id_buku'], 'id_user' => session()->get('id'), 'status' => 'kembali'])
                    ->get()->getRowArray();