app/Views/buku/index.php


                                <?php
                                    $db = \Config\Database::connect();
                                    $checkStatus = $db->table('peminjaman')
                                        ->where('id_buku', $b['id_buku'])
                                        ->where('id_user', session()->get('id'))
                                        ->whereIn('status', ['pending', 'disetujui', 'dipinjam'])
                                        ->orderBy('id_peminjaman', 'DESC')
                                        ->get()->getRowArray();
---
SELECT *
FROM `peminjaman`
WHERE `id_buku` = '2'
AND `id_user` = '1'
AND `status` IN ('pending','disetujui','dipinjam')
ORDER BY `id_peminjaman` DESC