app/Controllers/Buku.php

SELECT *
FROM `kategori`
---
   public function index()
{
    $keyword = $this->request->getGet('keyword');
    $sort    = $this->request->getGet('sort');

    // 1. Ambil Semua Kategori untuk Header Rak
    $kategori = $this->db->table('kategori')->get()->getResultArray();

SELECT *
FROM `buku`
WHERE `buku`.`id_buku` = '1'
---
    public function detail($id)
    {
        $buku = $this->db->table('buku')
            ->select('buku.*, kategori.nama_kategori, penulis.nama_penulis, penerbit.nama_penerbit, rak.nama_rak,
                      (SELECT AVG(rating) FROM ulasan WHERE ulasan.id_buku = buku.id_buku) as rata_rating,
                      (SELECT COUNT(id_ulasan) FROM ulasan WHERE ulasan.id_buku = buku.id_buku) as total_ulasan,
                      (SELECT COUNT(id_peminjaman) FROM peminjaman WHERE peminjaman.id_buku = buku.id_buku) as total_dipinjam')
            ->join('kategori', 'kategori.id_kategori = buku.id_kategori', 'left')
            ->join('penulis', 'penulis.id_penulis = buku.id_penulis', 'left')
            ->join('penerbit', 'penerbit.id_penerbit = buku.id_penerbit', 'left')
            ->join('buku_rak', 'buku_rak.id_buku = buku.id_buku', 'left')
            ->join('rak', 'rak.id_rak = buku_rak.id_rak', 'left')
            ->where('buku.id_buku', $id)
            ->get()->getRowArray();

        if (!$buku) {
            return redirect()->to('/buku')->with('error', 'Buku tidak ditemukan');

SELECT *
FROM `kategori`
SELECT *
FROM `penulis`
SELECT *
FROM `penerbit`
SELECT *
FROM `buku_rak`
WHERE `id_buku` = '1'
---
    public function edit($id)
    {
        $buku = $this->buku->find($id);
        if (!$buku) return redirect()->to('/buku');

        $data = [
            'title'    => 'Edit Data Buku',
            'buku'     => $buku,
            'kategori' => $this->db->table('kategori')->get()->getResultArray(),
            'penulis'  => $this->db->table('penulis')->get()->getResultArray(),
            'penerbit' => $this->db->table('penerbit')->get()->getResultArray(),
            'rak'      => $this->db->table('rak')->get()->getResultArray(),
        ];

        $currentRak = $this->db->table('buku_rak')->where('id_buku', $id)->get()->getRowArray();