app/Controllers/Denda.php

SELECT `peminjaman`.*, `users`.`username` as `nama`, `users`.`telepon`, `buku`.`judul`
FROM `peminjaman`
JOIN `users` ON `users`.`id` = `peminjaman`.`id_user`
JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`
WHERE `peminjaman`.`denda` > 0
---
    public function index()
    {
        // Ambil data peminjaman yang statusnya terlambat atau sudah kembali tapi ada denda
        $builder = $this->db->table('peminjaman');
        $builder->select('peminjaman.*, users.username as nama, users.telepon, buku.judul'); // Gunakan username sesuai tabel usermu
        $builder->join('users', 'users.id = peminjaman.id_user');
        $builder->join('buku', 'buku.id_buku = peminjaman.id_buku');
        $builder->where('peminjaman.denda >', 0);

        $data = [
            'title' => 'Data Denda | DigiLibree',
            'denda' => $builder->get()->getResultArray()