app/Controllers/Home.php

    public function index()
    {
        $db = \Config\Database::connect();
        $userId = session()->get('id_user');

        $data = [
            // --- DATA GLOBAL (ADMIN & USER BISA LIHAT) ---
            'total_buku'     => $db->table('buku')->countAllResults(),
            'total_kategori' => $db->table('kategori')->countAllResults(),

            // --- DATA KHUSUS ADMIN ---
            'total_member'   => $db->table('users')->where('role', 'anggota')->countAllResults(),
            'total_pinjam'   => $db->table('peminjaman')->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `buku`
SELECT COUNT(*) AS `numrows`
FROM `kategori`