app/Controllers/Log.php

    public function index()
    {
        // Pastikan nama tabel di join ('users') dan kolom ID sesuai dengan database kamu
        $data['log_aktivitas'] = $this->logModel->select('log_aktivitas.*, users.username')
                                       ->join('users', 'users.id = log_aktivitas.id_user', 'left')
                                       ->orderBy('log_aktivitas.created_at', 'DESC')
                                       ->findAll();
---
SELECT `log_aktivitas`.*, `users`.`username`
FROM `log_aktivitas`
LEFT JOIN `users` ON `users`.`id` = `log_aktivitas`.`id_user`
ORDER BY `log_aktivitas`.`created_at` DESC