app/Controllers/Peminjaman.php

    public function index()
    {
        $keyword = $this->request->getVar('keyword');
        $role    = session()->get('role');
        $userId  = session()->get('id');

        // Mulai membangun query agar tidak menulis join berulang-ulang
        $query = $this->pinjamModel->select('peminjaman.*, buku.judul, buku.id_penulis, users.username, users.telepon')
                                    ->join('buku', 'buku.id_buku = peminjaman.id_buku')
                                    ->join('users', 'users.id = peminjaman.id_user');

        if ($role == 'admin') {
            // Admin: Melihat semua transaksi
            if ($keyword) {
                $query->groupStart()
                      ->like('buku.judul', $keyword)
                      ->orLike('users.username', $keyword)
                      ->groupEnd();
            }
        } else {
            // User/Anggota: Hanya melihat milik sendiri
            $query->where('peminjaman.id_user', $userId);

            if ($keyword) {
                $query->like('buku.judul', $keyword);
            }
        }

        $peminjaman = $query->orderBy('peminjaman.id_peminjaman', 'DESC')->findAll();
---
SELECT `peminjaman`.*, `buku`.`judul`, `buku`.`id_penulis`, `users`.`username`, `users`.`telepon`
FROM `peminjaman`
JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`
JOIN `users` ON `users`.`id` = `peminjaman`.`id_user`
ORDER BY `peminjaman`.`id_peminjaman` DESC

    public function pinjamKilat($id_buku)
{
    $userId = session()->get('id');
    if (!$userId) {
        return redirect()->to('/login')->with('error', 'Eh, login dulu yuk! 😊');
    }

    if (session()->get('role') == 'admin') {
        return redirect()->back()->with('error', 'Admin gak perlu pinjam! 😎');
    }

    $buku = $this->bukuModel->find($id_buku);
---
SELECT *
FROM `buku`
WHERE `buku`.`id_buku` = '25'

public function persetujuan()
{
    if (session()->get('role') != 'admin') return redirect()->to('/');

    $data = [
        'title'    => 'Persetujuan Peminjaman',
        'requests' => $this->pinjamModel->select('peminjaman.*, buku.judul, users.username as nama')
                        ->join('buku', 'buku.id_buku = peminjaman.id_buku')
                        ->join('users', 'users.id = peminjaman.id_user')
                        ->where('peminjaman.status', 'pending')
                        ->findAll()
    ];
---
SELECT `peminjaman`.*, `buku`.`judul`, `buku`.`cover`, `buku`.`file_pdf`
FROM `peminjaman`
JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`
WHERE `peminjaman`.`id_user` = '6'
AND `peminjaman`.`status` IN ('kembali','ditolak')
ORDER BY `peminjaman`.`id_peminjaman` DESC

public function approve($id)
{
    $pinjam = $this->pinjamModel->find($id);
    $buku   = $this->bukuModel->find($pinjam['id_buku']);

    if ($buku['tersedia'] > 0) {
        $this->pinjamModel->update($id, ['status' => 'disetujui']);
        $this->bukuModel->update($pinjam['id_buku'], ['tersedia' => $buku['tersedia'] - 1]);
---
SELECT *
FROM `buku`
WHERE `buku`.`id_buku` = '10'
UPDATE `buku` SET `tersedia` = 4
WHERE `buku`.`id_buku` IN ('10')

public function proses_kembali($id_peminjaman)
{
    $pinjam = $this->db->table('peminjaman')->where('id_peminjaman', $id_peminjaman)->get()->getRowArray();

    $tgl_kembali = new \DateTime($pinjam['tanggal_kembali']);
    $tgl_sekarang = new \DateTime(date('Y-m-d'));

    $denda = 0;
    $status_denda = 'tidak_ada';

    // Jika telat
    if ($tgl_sekarang > $tgl_kembali) {
        $selisih = $tgl_sekarang->diff($tgl_kembali)->days;
        $denda = $selisih * 2000; // Contoh: 2rb per hari
        $status_denda = 'belum_bayar';
    }

    $this->db->table('peminjaman')->where('id_peminjaman', $id_peminjaman)->update([
        'tanggal_pengembalian_asli' => date('Y-m-d'),
        'status'       => 'kembali',
        'denda'        => $denda,
        'status_denda' => $status_denda
    ]);
---
SELECT *
FROM `peminjaman`
WHERE `peminjaman`.`id_peminjaman` = '40'

public function lunas_denda($id)
{
    $this->db->table('peminjaman')->where('id_peminjaman', $id)->update(['status_denda' => 'lunas']);
---
UPDATE `peminjaman` SET `denda` = 1024032, `catatan` = 'gambar nya g ada', `status_denda` = 'belum_bayar'
WHERE `peminjaman`.`id_peminjaman` IN ('40')