app/Controllers/Peminjaman.php

UPDATE `buku` SET `tersedia` = 9
WHERE `buku`.`id_buku` IN ('25')
---
    public function pinjamKilat($id_buku)
    {
        $userId = session()->get('id');
        if (!$userId) return redirect()->to('/login')->with('error', 'Login dulu yuk! 😊');
        if (session()->get('role') == 'admin') return redirect()->back()->with('error', 'Admin gak perlu pinjam!');

        $buku = $this->bukuModel->find($id_buku);
        if (!$buku || $buku['tersedia'] <= 0) return redirect()->back()->with('error', 'Stok buku abis!');

        $jumlah_aktif = $this->pinjamModel->where('id_user', $userId)
                                          ->whereIn('status', ['dipinjam', 'disetujui'])
                                          ->countAllResults();

        $status_baru = ($jumlah_aktif >= 3) ? 'pending' : 'disetujui';
        $pesan_sukses = ($status_baru == 'pending') ? 'Kuota penuh, tunggu ACC admin ya!' : 'Berhasil dipinjam!';

        $data = [
            'id_user'         => $userId,
            'id_buku'         => $id_buku,
            'tanggal_pinjam'  => date('Y-m-d'),
            'tanggal_kembali' => date('Y-m-d', strtotime('+7 days')),
            'status'          => $status_baru,
            'denda'           => 0
        ];

        if ($this->pinjamModel->insert($data)) {
            if ($status_baru == 'disetujui') {
                $this->bukuModel->update($id_buku, ['tersedia' => $buku['tersedia'] - 1]);

SELECT `peminjaman`.*, `buku`.`judul`, `users`.`username` as `nama`
FROM `peminjaman`
JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`
JOIN `users` ON `users`.`id` = `peminjaman`.`id_user`
WHERE `peminjaman`.`status` = 'pending'
---
    public function persetujuan()
    {
        if (session()->get('role') != 'admin') return redirect()->to('/');
        $data['requests'] = $this->pinjamModel->select('peminjaman.*, buku.judul, users.username as nama')
                                ->join('buku', 'buku.id_buku = peminjaman.id_buku')
                                ->join('users', 'users.id = peminjaman.id_user')
                                ->where('peminjaman.status', 'pending')
                                ->findAll();

SELECT *
FROM `peminjaman`
WHERE `peminjaman`.`id_peminjaman` = '24'
---
    public function simpanUlasan()
    {
        $id_peminjaman = $this->request->getPost('id_peminjaman');
        $cek = $this->db->table('ulasan')->where('id_peminjaman', $id_peminjaman)->get()->getRow();

        if ($cek) return redirect()->back()->with('error', 'Sudah pernah diulas!');

        $data = [
            'id_user'       => session()->get('id'),
            'id_buku'       => $this->request->getPost('id_buku'),
            'id_peminjaman' => $id_peminjaman,
            'rating'        => $this->request->getPost('rating'),
            'komentar'      => $this->request->getPost('komentar'),
        ];