app/Controllers/Users.php

    public function index()
    {
        $keyword = $this->request->getGet('keyword');
        $role = $this->request->getGet('role');

        $builder = $this->users;

        if ($keyword) {
            $builder = $builder->like('nama', $keyword);
        }

        if ($role) {
            $builder = $builder->where('role', $role);
        }

        $data['users'] = $builder->paginate(10);
---
SELECT *
FROM `users`
WHERE `nama` LIKE '%aboy%' ESCAPE '!'
AND `role` = 'anggota'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `nama` LIKE '%aboy%' ESCAPE '!'
AND `role` = 'anggota'

    public function edit($id)
    {
        $data['user'] = $this->users->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

    public function update($id)
{
    // 1. Ambil data user lama dari database
    $userLama = $this->users->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

    }

    // 5. Eksekusi Update
    $this->users->update($id, $data);
---
UPDATE `users` SET `nama` = 'Obeyy', `email` = 'muhamadrobirahmawan70@gmail.com', `username` = 'Beyy', `role` = 'admin', `foto` = '1775880153_09cd2933c38eb181b94f.webp'
WHERE `users`.`id` IN ('1')

    public function delete($id)
    {
        $user = $this->users->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

    public function detail($id = null)
{
    // 1. Jika ID kosong (misal dipanggil dari tombol kembali yang salah),
    // otomatis ambil ID dari user yang sedang login
    if ($id === null) {
        $id = session()->get('id');
    }

    // 2. Proteksi: Cegah user biasa ngintip profil orang lain
    if (session()->get('role') != 'admin' && session()->get('id') != $id) {
        return redirect()->to('/dashboard')->with('error', 'Kamu tidak punya akses ke profil tersebut.');
    }

    // 3. Cari datanya
    $user = $this->users->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'