app/Views/layouts/menu.php

SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `denda` > 0
---
                <i class="bi bi-cash-stack"></i> Data Denda
                <?php
                    $db = \Config\Database::connect();
                    $countDenda = $db->table('peminjaman')->where('denda >', 0)->countAllResults();