app/Views/layouts/menu.php

        <?php
            // Opsional: Notifikasi angka denda aktif (Badge)
            $db = \Config\Database::connect();
            $countDenda = $db->table('peminjaman')->where('denda >', 0)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `denda` > 0